# Seja muito bem vindo(a), vamos explorar essa base comigo !?

### Seguiremos de forma bem detalhada uma análise de dados exploratória (EDA), buscaremos por insights nessa jornada!

In [33]:
# 1. Importar bibliotecas e definir aliases:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# 2 - Carregar dataset na variável 'df':
df = pd.read_csv("netflix_titles.csv")

# 3 - Visualizar 5 primeiras linhas :
df.head()

,title,type,genres,releaseYear,imdbId,imdbAverageRating,imdbNumVotes,availableCountries
0,Ariel,movie,"Comedy, Crime, Drama",1988.0,tt0094675,7.4,9234.0,NaN
1,Shadows in Paradise,movie,"Comedy, Drama, Music",1986.0,tt0092149,7.4,8070.0,NaN
2,Forrest Gump,movie,"Drama, Romance",1994.0,tt0109830,8.8,2390234.0,NaN
3,American Beauty,movie,Drama,1999.0,tt0169547,8.3,1252312.0,NaN
4,The Fifth Element,movie,"Action, Adventure, Sci-Fi",1997.0,tt0119116,7.6,528793.0,NaN

Vizualizando as primeiras linhas podemos, perceber que temos nomes, datas

In [34]:
# 4 - Vizualizar as colunas:
df.columns

Index(['title', 'type', 'genres', 'releaseYear', 'imdbId', 'imdbAverageRating',
       'imdbNumVotes', 'availableCountries'],
      dtype='object')